misc/artillery_config_local.yaml
config:
  target: 'http://localhost:8080/predictions/chaser_ner_model/'
  phases:
    - duration: 600
      arrivalRate: 5
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./payloadGenerator.js"

scenarios:
  - flow:
    - function: "generatePayload"
    - post:
        url: "/"
        json:
          text: "{{ text }}"

#processors:
#  generatePayload: "./payloadGenerator.js"